pkg/wsman/wsmantesting/responses/amt/eventlogentry/get.xml

<?xml version="1.0" encoding="UTF-8"?>
<a:Envelope xmlns:a="http://www.w3.org/2003/05/soap-envelope"
    xmlns:b="http://schemas.xmlsoap.org/ws/2004/08/addressing"
    xmlns:c="http://schemas.dmtf.org/wbem/wsman/1/wsman.xsd"
    xmlns:d="http://schemas.xmlsoap.org/ws/2005/02/trust"
    xmlns:e="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
    xmlns:f="http://schemas.dmtf.org/wbem/wsman/1/cimbinding.xsd"
    xmlns:g="http://intel.com/wbem/wscim/1/amt-schema/1/AMT_EventLogEntry"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <a:Header>
        <b:To>http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</b:To>
        <b:RelatesTo>0</b:RelatesTo>
        <b:Action a:mustUnderstand="true">http://schemas.xmlsoap.org/ws/2004/09/transfer/GetResponse</b:Action>
        <b:MessageID>uuid:00000000-8086-8086-8086-0000000002AA</b:MessageID>
        <c:ResourceURI>http://intel.com/wbem/wscim/1/amt-schema/1/AMT_EventLogEntry</c:ResourceURI>
    </a:Header>
    <a:Body>
        <g:AMT_EventLogEntry>
            <g:CreationClassName>AMT_EventLogEntry</g:CreationClassName>
            <g:DeviceAddress>32</g:DeviceAddress>
            <g:ElementName>Event Log Entry</g:ElementName>
            <g:EventData>AA11BB22</g:EventData>
            <g:EventSensorType>15</g:EventSensorType>
            <g:EventType>5</g:EventType>
            <g:RecordID>1</g:RecordID>
            <g:TimeStamp>1712551200</g:TimeStamp>
        </g:AMT_EventLogEntry>
    </a:Body>
</a:Envelope>
